/*
 *   이중 반복문 (중첩 for)
 *   형식)
 *        가로 : 이차 for
 *        세로 : 일차 for 
 *        
 *        2*1=2  3*1=3 4*1=4 5*1=5 .... 9*1=9
 *        --
 *        --
 *        --
 *        --
 *        2*9=18 3*9=27 -----
 *                   ↗ false: 종료
 *             1  →  2  ← 4
 *        for(초기값;조건식;증가식) ==> 줄수  ===> 추천
 *        {               ↗
 *                   ↓ true
 *                   3
 *          ==========================================
 *                1 →  2  ← 4
 *           for(초기값;조건식;증가식)==> 실제 반복내용 수행 
 *           {               ↗
 *                    ↓ true
 *                    3
 *               반복수행 문장 
 *           }
 *          ==========================================
 *           다음줄에 출력 
 *        }
 */
public class 이중반복문_for {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
        for(int i=1;i<=5;i++)
        {
        	for(int j=1;j<=5;j++)
        	{
        		System.out.println("i="+i+",j="+j);
        		// i=1  => j=1,2,3,4,5
        		// i=2  => j=1,2,3,4,5
        		// i=3  => j=1,2,3,4,5
        		// i=4  => j=1,2,3,4,5
        		// i=5  => j=1,2,3,4,5
        	}
        }
	}

}






